(function ($, m4a) {
    m4a.resources = {};

    $.extend(m4a.resources, {
        profiles: {
            "man_d": "Без ограничений",
            "wch_html": "Ширина коляски в см",
            "wch_d": "Я на коляске",
            "wch_d2": "Я на коляске шириной ",
            "wch_d3": " см",
            "trl_html": "Ширина тележки в см",
            "trl_d": "Я c тележкой",
            "trl_d2": "Я c тележкой шириной ",
            "trl_d3": " см"
        },
        routes: {
            "wch_w": "Ширина коляски",
            "wch_w1": " до ",
            "wch_w2": " см",
            "n_str": "Лестниц нет",
            "stps": "Ступенек",
            "n_ramp": "Из них без рельс и рамп",
            "elev_y": "Лифт есть",
            "elev_n": "Лифта нет",
            "elev_y_1": ", экономит ",
            "elev_y_2": " ступенек",
            "min_max": "Мин-макс. расстояние между колесами",
            "cm": " см",
            "no_r": "Аппарели отсутствуют",
            "slope": "Угол наклона",
            "no_lev_surf": "Наклонных поверхностей нет",
            "entr": "Вход",
            "obt_arent_sh_en": "Препятствия не отображаются, так как не выбран вход",
            "exit": "Выход",
            "obt_arent_sh_ex": "Препятствия не отображаются, так как не выбран выход",
            "escal": "Эскалаторов "
        },
        inline: {
            "start_st": "Не выбрана входная или выходная станция!",
            "eq_st": "Выбраны одинаковые станции!",
            "st_st": "Выберите начальную станцию",
            "end_st": "Выберите конечную станцию"
        }
    })
})(jQuery, m4a)