(function ($, m4a) {
    m4a.resources = {};

    $.extend(m4a.resources, {
        profiles: {
            "man_d": "Без обмежень",
            "wch_html": "Ширина коляски в см",
            "wch_d": "Я в кріслі колісному",
            "wch_d2": "Я в кріслі колісному завширшки ",
            "wch_d3": " см",
            "trl_html": "Ширина дитячої коляски в см",
            "trl_d": "Я з дитячою коляскою",
            "trl_d2": "Я з дитячою коляскою завширшки ",
            "trl_d3": " см"
        },
        routes: {
            "wch_w": "Мін. ширина проходу",
            "wch_w1": "",
            "wch_w2": " см",
            "n_str": "Сходів немає",
            "stps": "Всього сходинок",
            "n_ramp": "З них без рельсів та пандусів",
            "elev_y": "Ліфт є",
            "elev_n": "Немає ліфту",
            "elev_y_1": ", заощаджує ",
            "elev_y_2": " сходинок",
            "min_max": "Відстань між колесами",
            "cm": " см",
            "no_r": "Рельси відсутні",
            "slope": "Макс. кут нахилу",
            "no_lev_surf": "Похилих поверхонь немає",
            "entr": "Вхід",
            "obt_arent_sh_en": "Перешкоди не відображаються, так як не обрано вхід",
            "exit": "Вихід",
            "obt_arent_sh_ex": "Перешкоди не відображаються, так як не обрано вихід",
            "show": "Ще...",
            "hide": "Сховати",
            "help": "Потрібна допомога офіційних служб?",
            "help_link": "http://metro4all.org/uk/official-assistance/",
            "from": "Звідси",
            "to": "Сюди",
            "escal_y": "Ескалатор",
            "escal_n": "Ескалаторів немає"
        },
        inline: {
            "start_st": "Не обрана вхідна або вихідна станція!",
            "eq_st": "Обрані однакові станції!",
            "st_st": "Оберіть початкову станцію",
            "end_st": "Оберіть кнцеву станцію"
        },
        map: {
            "extent": "Показати все місто"
        }
    })
})(jQuery, m4a)
