(function ($, m4a) {
    m4a.resources = {};

    $.extend(m4a.resources, {
        profiles: {
            "man_d": "Без абмежаванняў",
            "wch_html": "Шырыня каляскі ў см",
            "wch_d": "Я на калясцы",
            "wch_d2": "Я на калясцы шырынёй ",
            "wch_d3": " см",
            "trl_html": "Шырыня дзіцячай каляскі ў см",
            "trl_d": "Я з дзіцячай каляскай",
            "trl_d2": "Я з дзіцячай каляскай шырынёй ",
            "trl_d3": " см"
        },
        routes: {
            "wch_w": "Шырыня каляскі",
            "wch_w1": " да ",
            "wch_w2": " см",
            "n_str": "Лесвіцаў няма",
            "stps": "Прыступак",
            "n_ramp": "З іх без рэек і рампы",
            "elev_y": "Ліфт ёсць",
            "elev_n": "Ліфта няма",
            "elev_y_1": ", эканоміць ",
            "elev_y_2": " прыступак",
            "min_max": "Мін-макс. адлегласць паміж коламі",
            "cm": " см",
            "no_r": "Апарэлі адсутнічаюць",
            "slope": "Вугал нахілу",
            "no_lev_surf": "Нахільных паверхняў няма",
            "entr": "Уваход",
            "obt_arent_sh_en": "Перашкоды не адлюстроўваюцца, так як не абраны ўваход",
            "exit": "Выхад",
            "obt_arent_sh_ex": "Перашкоды не адлюстроўваюцца, таму што не абраны выхад",
            "show": "Больш...",
            "hide": "Схаваць",
            "help": "Патрабуецца дапамога афіцыйных служб?",
            "help_link": "http://metro4all.org/official-assistance/",
            "from": "Адсюль",
            "to": "Дагэтуль",
            "escal_y": "Эскалатар",
            "escal_n": "Эскалатараў няма"
        },
        inline: {
            "start_st": "Не абрана ўваходная або выходная станцыя!",
            "eq_st": "Абраныя аднолькавыя станцыі!",
            "st_st": "Выберыце пачатковую станцыю",
            "end_st": "Выберыце канчатковую станцыю"
        },
        map: {
            "extent": "Паказаць увесь горад"
        }
    })
})(jQuery, m4a)
